app/controllers/iphones_controller.rb

	def create
		if Iphone.count != 0 then Iphone.destroy_all end
		@iphone = Iphone.new(params[:iphone])

		regex2 = /\s+/

		page_url = "http://xyo.net/iphone-games/?country=US"
		page = Nokogiri::HTML(open(page_url))

		@iphone.rank = 1
		@iphone.title = page.css("div.titleCont h2")[0].text.gsub(regex2,' ')
		@iphone.downloads = page.css("div.extraInfo span.downNo")[0].text.gsub(regex2,' ')
		@iphone.price = page.css("div.appInfoCont strong.price")[0].text.gsub(regex2,' ')

		array = ""

		for i in 0..3 do
		if i != 2
		array = array + page.css("div.screenshot ul.sentiments li")[i].text.strip + "; "
		end
		end
		@iphone.comments = array
		@iphone.save
---
DELETE FROM "iphones" WHERE "iphones"."id" = $1  [["id", 1]]
SELECT "iphones".* FROM "iphones"
SELECT COUNT(*) FROM "iphones"
INSERT INTO "iphones" ("comments", "created_at", "downloads", "price", "rank", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"